In [1]:
import mysql.connector as connection
import pandas as pd

try:
    mydb = connection.connect(host="localhost", user="root", passwd="mysql", use_pure=True, database="FSDS_assignment")
    mycursor = mydb.cursor()
except Exception as e:
    mydb.close()
    print(str(e))

#### Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

In [4]:
query = "SELECT * FROM WORKER ORDER BY SALARY DESC LIMIT 4,1"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

   0          1     2      3                   4           5  \
0  6  Shaktiman  Hero  50000 2017-12-11 09:00:00  Accountant

                          6
0  Shaktiman.Hero@gmail.com

#### Q-20. Write an SQL query to fetch the list of employees with the same salary.

In [3]:
query = "SELECT * FROM WORKER WHERE SALARY IN (SELECT SALARY FROM WORKER GROUP BY SALARY HAVING COUNT(*)>1)"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

   0          1        2      3                   4            5  \
0  1      Krish     Naik  50000 2014-12-11 09:00:00  Development
1  3     Sanket    Kumar  70000 2014-12-11 09:00:00           HR
2  4     Darius  Bengali  70000 2015-12-13 09:00:00           HR
3  5    Sathish  Bhansal  30000 2017-10-21 09:00:00   Accountant
4  6  Shaktiman     Hero  50000 2017-12-11 09:00:00   Accountant
5  7     Vishnu    Singh  30000 2017-10-21 09:00:00   Accountant

                           6
0       Krish.Naik@gmail.com
1     Sanket.Kumar@gmail.com
2   Darius.Bengali@gmail.com
3  Sathish.Bhansal@gmail.com
4   Shaktiman.Hero@gmail.com
5     Vishnu.Singh@gmail.com